[
  {
    "title": "Trump’s tariff blitz could hardly have come at a worse time for China - The Washington Post",
    "score": 2,
    "tags": [
      "Finance",
      "Politics"
    ]
  },
  {
    "title": "‘This is Not Normal’: Trump’s Tariffs Upend the Bond Market - The New York Times",
    "score": 2,
    "tags": [
      "Finance",
      "Politics"
    ]
  },
  {
    "title": "Another inflation report underlines the strength of the US economy before Trump’s tariff chaos - CNN",
    "score": 2,
    "tags": [
      "Finance",
      "Politics"
    ]
  },
  {
    "title": "Copilot Recall: Microsoft rolls out AI screenshot tool - BBC",
    "score": 2,
    "tags": [
      "AI",
      "Tech"
    ]
  },
  {
    "title": "Senate confirms Trump nominee for chairman of Joint Chiefs of Staff in overnight vote - AP News",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "Tariff delay gives Nintendo time to ship Switch 2 consoles",
    "score": 1,
    "tags": [
      "Finance"
    ]
  },
  {
    "title": "Breakout stocks: ITC, Jyothy Labs can rally up to 18%, show charts",
    "score": 1,
    "tags": [
      "Finance"
    ]
  },
  {
    "title": "Tesla Unveils New Cybertruck Long Range Trim With A 362-Mile Range And Reduced Features",
    "score": 1,
    "tags": [
      "Tech"
    ]
  },
  {
    "title": "Hexagon announces an update on performance in the first quarter of 2025",
    "score": 1,
    "tags": [
      "Tech"
    ]
  },
  {
    "title": "MAGA Beekeeper Admits Trump Tariffs Have Cost Him Half His Business - “I never thought I was going to lose this much money this fast,” the beekeeper told CNN.",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "Education Secretary Wants 'A1' in Classrooms as Early as Kindergarten. She Means AI",
    "score": 1,
    "tags": [
      "AI"
    ]
  },
  {
    "title": "The Trump administration is begging Xi Jinping to call Trump quickly.",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "Maryland judge again asks government to return man wrongly deported to El Salvador - NPR",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "China raises tariffs on U.S. goods to 125 percent as trade war deepens - The Washington Post",
    "score": 1,
    "tags": [
      "Finance"
    ]
  },
  {
    "title": "Senate confirms Trump nominee Caine for chairman of Joint Chiefs of Staff in overnight vote - AP News",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "Khalil ruling to test Trump deportation tactic of sending detainees to Louisiana - The Washington Post",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "US bank profits rise, but executives raise more tariff alarms - Reuters",
    "score": 1,
    "tags": [
      "Finance"
    ]
  },
  {
    "title": "Google on other designs it explored for the Pixel 9a camera - 9to5Google",
    "score": 1,
    "tags": [
      "Tech"
    ]
  },
  {
    "title": "OpenAI will soon phase out GPT-4 from ChatGPT - TechCrunch",
    "score": 1,
    "tags": [
      "AI"
    ]
  },
  {
    "title": "Trump’s tariffs ‘pause’ could help Nintendo ship more Switch 2s - The Verge",
    "score": 1,
    "tags": [
      "Politics"
    ]
  },
  {
    "title": "NASA spacecraft spots monster black hole bursting with X-rays 'releasing a hundred times more energy than we have seen elsewhere' - Space.com",
    "score": 1,
    "tags": [
      "Science"
    ]
  },
  {
    "title": "Massive cuts to NASA science proposed in early White House budget plan - The Washington Post",
    "score": 1,
    "tags": [
      "Science"
    ]
  },
  {
    "title": "New experiment halves weight limit of elusive neutrinos - Phys.org",
    "score": 1,
    "tags": [
      "Science"
    ]
  },
  {
    "title": "DDoS Mitigation Leak",
    "score": 1,
    "tags": [
      "Cybersecurity"
    ]
  },
  {
    "title": "What is birdnesting? Divorced couple's custody arrangement being called ‘genius'",
    "score": 0,
    "tags": []
  },
  {
    "title": "Spanish family celebrating mom's birthday named victims in Hudson River helicopter crash",
    "score": 0,
    "tags": []
  },
  {
    "title": "Basel Medical Group Signs Agreement to Acquire Bethesda Medical to Strengthen Healthcare Ecosystem in Singapore and Southeast Asia",
    "score": 0,
    "tags": []
  },
  {
    "title": "What’s one product you bought that turned you into a total snob — like, you can never go back to the cheap stuff?",
    "score": 0,
    "tags": []
  },
  {
    "title": "Dad Who Didn’t Want a Dog",
    "score": 0,
    "tags": []
  },
  {
    "title": "Madlad took 11 years",
    "score": 0,
    "tags": []
  },
  {
    "title": "Feel free if you need anything else..",
    "score": 0,
    "tags": []
  },
  {
    "title": "Me_irl",
    "score": 0,
    "tags": []
  },
  {
    "title": "Don't be a Lauwren",
    "score": 0,
    "tags": []
  },
  {
    "title": "Custo made carved skull crown in dark red",
    "score": 0,
    "tags": []
  },
  {
    "title": "Millennial words that younger people don’t know",
    "score": 0,
    "tags": []
  },
  {
    "title": "Flipped off the seatbelt cam for laughs. Joke’s on me — girlfriend wasn’t strapped in right. $400 fine.",
    "score": 0,
    "tags": []
  },
  {
    "title": "In the film “Taxi Driver” (1976), 12 year-old Jodie Foster (right) had her 20 year-old sister, Connie, to stand-in for her in the more 'explicit' scenes.",
    "score": 0,
    "tags": []
  },
  {
    "title": "Why would you ever brag about this?",
    "score": 0,
    "tags": []
  },
  {
    "title": "China Raises Tariffs on US Goods to 125% in Retaliation",
    "score": 0,
    "tags": []
  },
  {
    "title": "Small plane crashes in Boca Raton, Florida; all 3 on board killed - ABC News",
    "score": 0,
    "tags": []
  },
  {
    "title": "Head of US military base in Greenland fired after JD Vance visit - The Guardian",
    "score": 0,
    "tags": []
  },
  {
    "title": "Siemens Executive and His Family Died in Hudson Helicopter Crash - The New York Times",
    "score": 0,
    "tags": []
  },
  {
    "title": "Menendez brothers' aunt breaks her silence in exclusive interview as case goes to court - ABC News",
    "score": 0,
    "tags": []
  },
  {
    "title": "Lori Vallow's brother says he had 'no doubt' she conspired to kill her fourth husband - NBC News",
    "score": 0,
    "tags": []
  },
  {
    "title": "Sen. Michael Bennet is officially running for governor - Colorado Public Radio",
    "score": 0,
    "tags": []
  },
  {
    "title": "Top Iranian officials told Khamenei to allow US nuke talks or risk fall of regime – NYT - The Times of Israel",
    "score": 0,
    "tags": []
  },
  {
    "title": "South African helicopter crash blamed on penguin in a box - NBC News",
    "score": 0,
    "tags": []
  },
  {
    "title": "Ukraine allies pledge €21bn in fresh military support to Kyiv - BBC",
    "score": 0,
    "tags": []
  },
  {
    "title": "Oronoco woman is the face of U.S. small businesses struggling with China tariffs - Post Bulletin",
    "score": 0,
    "tags": []
  },
  {
    "title": "Eric Dane, star of ‘Euphoria’ and ‘Grey’s Anatomy,’ reveals he has ALS - AP News",
    "score": 0,
    "tags": []
  },
  {
    "title": "New details emerge after Jillian Lauren, wife of Weezer bassist, accused of shooting at LAPD - Los Angeles Times",
    "score": 0,
    "tags": []
  },
  {
    "title": "'Yellowjackets' Finale: Melanie Lynskey on Shauna, Season 3 Deaths - Variety",
    "score": 0,
    "tags": []
  },
  {
    "title": "Teddi Mellencamp reveals what her ‘chances’ of survival are as she battles stage 4 cancer - Page Six",
    "score": 0,
    "tags": []
  },
  {
    "title": "With $3 million guaranteed for Joe Flacco, the Browns aren't necessarily done at quarterback - NBC Sports",
    "score": 0,
    "tags": []
  },
  {
    "title": "Gennaro Filice 2025 NFL mock draft 2.0: RB Ashton Jeanty goes top 5! Cowboys jump for Jalon Walker - NFL.com",
    "score": 0,
    "tags": []
  },
  {
    "title": "Impossible for Verstappen to repeat Suzuka heroics in Bahrain - Horner - Motorsport.com",
    "score": 0,
    "tags": []
  },
  {
    "title": "Masters 2025 Round 1: Rory McIlroy’s collapse, Justin Rose’s hot start and more - The New York Times",
    "score": 0,
    "tags": []
  },
  {
    "title": "A Tiny Piece of Mouse Brain Has Finally Been Mapped in Mindblowing Detail - ScienceAlert",
    "score": 0,
    "tags": []
  },
  {
    "title": "US Measles Cases Increase 17% in a Week to 712; Now in 24 States - Bloomberg",
    "score": 0,
    "tags": []
  },
  {
    "title": "Health Secretary RFK Jr. falsely claims that measles vaccine protection ‘wanes very quickly’ - NBC News",
    "score": 0,
    "tags": []
  },
  {
    "title": "As measles spreads, federal budget cuts force closure of vaccine clinics - NPR",
    "score": 0,
    "tags": []
  },
  {
    "title": "One-Third of Maternal Deaths Occur Long After Delivery, Study Finds - The New York Times",
    "score": 0,
    "tags": []
  },
  {
    "title": "The Story Behind “100 Go Mistakes and How to Avoid Them”",
    "score": 0,
    "tags": []
  },
  {
    "title": "A port of Mbed-TLS for the Classic Macintosh OS 7/8/9",
    "score": 0,
    "tags": []
  },
  {
    "title": "Colossus for Rapid Storage",
    "score": 0,
    "tags": []
  }
]