{
  "call of duty": [
    "How To Unlock The Nail Gun And All Tribute Event Rewards In Black Ops 6 And Warzone - GameSpot (Published: Thu, 17 Apr 2025 21:24:06 GMT)",
    "Verdansk Launch Trailer | Call of Duty: Warzone (Published: 2025-03-31T12:59:46Z)",
    "Call of Duty in the Future.. #callofduty #warzone2 #ghosts (Published: 2025-04-01T00:01:00Z)",
    "I'm Alan Sealls, your friendly neighborhood meteorologist who woke up one day to Reddit calling me the \"Best weatherman ever\" AMA. (Reddit)",
    "Call Of Duty: Black Ops 6 - Black Ops Tribute Event Guide - TheGamer (Published: Thu, 17 Apr 2025 22:55:00 GMT)",
    "Tinashe Says She Brings Her PS5 on Tour Just to Play ‘Call of Duty’ - Rolling Stone (Published: Fri, 18 Apr 2025 13:45:32 GMT)",
    "This guy made the call of duty map \"nuke town\" as his own paintball field (Reddit)",
    "The emblem creator is the best part of any Call of Duty. This pops up every time I kill someone. (Reddit)",
    "IT&#39;S TIME TO BEGIN THE WAR | CALL OF DUTY MODERN WARFARE #2 (Published: 2025-04-06T03:30:01Z)",
    "WELCOME TO CALL OF DUTY MODERN WARFARE (Published: 2025-03-28T03:30:33Z)",
    "Game Pass adds Clair Obscur: Expedition 33, Towerborne, Call of Duty: Modern Warfare II, and more in late April to early May - Gematsu (Published: Tue, 15 Apr 2025 13:23:50 GMT)",
    "🚘 Candy Crush vs Call of Duty vs PUBG vs Ludo King vs Free Fire 😎High Jump #beamngdrive​ #ytshorts​ (Published: 2025-04-14T15:05:41Z)",
    "The Call of Duty moment that changed internet forever (Reddit)",
    "Call of Duty: Warzone & Black Ops 6 - Official Bluntman & Chronic Tracer Pack Bundle Trailer - IGN (Published: Fri, 18 Apr 2025 18:25:27 GMT)",
    "Can’t wait to play the new Call of Duty! (Reddit)"
  ],
  "cod mobile": [
    "OH MY GOD! YOU GUYS WON'T IMAGINE WHAT JUST HAPPENED!!!!! (Reddit)",
    "DID YOU KNOW THIS SPOT ON STANDOFF #codm #codmobile #callofdutymobile (Published: 2025-03-23T01:42:48Z)",
    "Jessica Pegula enlists with Activision for Call of Duty: Mobile activation - Sports Business Journal (Published: Thu, 20 Mar 2025 07:00:00 GMT)",
    "Cannot report a bug in CoD mobile because there's a bug on the bug reporting page. When you type, the submit button disappears. (Reddit)",
    "I CANT BELIEVE THIS #codmobile #callofdutymobile #codm (Published: 2025-03-22T01:53:09Z)",
    "Introducing Call of Duty: Mobile Season 4 — Infinity Realm - Call of Duty (Published: Thu, 17 Apr 2025 07:00:00 GMT)",
    "Doomfist Has 18+ Bugs Across 4 Skills. I Gathered Examples for Every Single One of Them. (Reddit)",
    "Cursed_CP (Reddit)",
    "Introducing Call of Duty: Mobile Season 3 — Cyber Mirage - Call of Duty (Published: Thu, 20 Mar 2025 07:00:00 GMT)",
    "COD Mobile: Season 3 Release Date, Wildcards, Mythics, & More - Sports Illustrated (Published: Fri, 21 Mar 2025 07:00:00 GMT)",
    "Call of Duty®: Mobile - Make it Mythic Trailer (Published: 2025-04-03T17:01:14Z)",
    "I've spent over 330 days on COD: Mobile this year – here's how to pick the perfect gaming phone - TechRadar (Published: Mon, 30 Dec 2024 08:00:00 GMT)",
    "I am an Behavioral Psychologist who happens to be a gamer, too. Your complaints are falling on deaf ears - hear me out. (Reddit)",
    "New R.A.P.S vs XS1 Goliath &amp; Flamenaut in CODM (Published: 2025-03-28T12:50:32Z)",
    "شانس شما چطوره 😱؟؟؟ #codmobile #کالاف_دیوتی_موبایل #کالاف #codm #cod #shortvideo #گردونه (Published: 2025-04-03T21:41:23Z)"
  ],
  "cod warzone": [
    "Call of Duty: Warzone Loses Senior Creative Director - Game Rant (Published: Tue, 15 Apr 2025 23:46:00 GMT)",
    "Let Me Know😭 / Best Meta AMAX Loadout for Warzone S3!😍 / all skins in bio!⬆  #warzone #callofduty (Published: 2025-04-11T18:04:30Z)",
    "Call of Duty has a serious identity crisis and is alienating the casual players who are the majority demographic. (Reddit)",
    "How To Unlock The Nail Gun And All Tribute Event Rewards In Black Ops 6 And Warzone - GameSpot (Published: Thu, 17 Apr 2025 21:24:06 GMT)",
    "[COD WARZONE] I think I’ve downloaded the wrong Call Of Duty... (Reddit)",
    "Verdansk Launch Trailer | Call of Duty: Warzone (Published: 2025-03-31T12:59:46Z)",
    "What Your Favorite Weapon Says About You (Reddit)",
    "TIMTHETATMAN RETURNS TO VERDANSK WITH CLOAKZY/NICKMERCS (Published: 2025-04-04T03:19:34Z)",
    "Tinashe Says She Brings Her PS5 on Tour Just to Play ‘Call of Duty’ - Rolling Stone (Published: Fri, 18 Apr 2025 13:45:32 GMT)",
    "You can't be serious.... Like, how??!! (Reddit)",
    "Call of Duty’s next reported collab could add Tom Cruise in your squad next month - Destructoid (Published: Fri, 18 Apr 2025 21:07:00 GMT)",
    "Ultra Next-Level MW3 Details You Missed #callofduty #cod #warzone #mw3 (Published: 2025-04-06T07:03:22Z)",
    "Grandpa what are you playing? -COD warzone grandson (Reddit)",
    "Call of Duty: Warzone & Black Ops 6 - Official Bluntman & Chronic Tracer Pack Bundle Trailer - IGN (Published: Fri, 18 Apr 2025 18:25:27 GMT)",
    "Ransom - Spray Paint Trickshot @MovyFTW #cod #modernwarfare #blackops6 #rebirthisland #callofduty (Published: 2025-04-03T16:12:39Z)"
  ],
  "apex legends": [
    "Apex Legends Update Fixes Annoying Bugs - Game Rant (Published: Thu, 17 Apr 2025 01:05:16 GMT)",
    "\"This is just like that time we played Apex Legends...\" (Reddit)",
    "Mande Finds a New Broken Nade Spot #apexlegends (Published: 2025-04-09T18:00:13Z)",
    "EXCLUSIVE – Ubisoft is Developing a New Battle Royale Heavily Inspired by Apex Legends - Insider Gaming (Published: Wed, 16 Apr 2025 20:14:59 GMT)",
    "Lifeline from Apex Legends cosplay by Kay Bear (Reddit)",
    "今年のエイプリルフールイベントもカオスなので解説 | apexlegends #apex #shorts (Published: 2025-04-01T22:00:44Z)",
    "So I started playing Apex Legends (Reddit)",
    "Ubisoft Has A New Battle Royale Game In Development Inspired By Apex Legends – Rumor - Wccftech (Published: Thu, 17 Apr 2025 19:06:00 GMT)",
    "Ubisoft Is Making Another Battle Royale, This One Inspired By Apex Legends - Report - GameSpot (Published: Wed, 16 Apr 2025 22:15:31 GMT)",
    "I've been working on CGI Apex Legends short for almost a month. Tomorrow I will release the full thing on my channel and here on reddit. (Reddit)",
    "アビリティとパワーソードで全力防御したニューキャッスルならシーラ耐えれる説を検証 | apexlegends #apex #shorts (Published: 2025-04-06T22:00:48Z)",
    "Respawn migrates Apex Legends to Amazon GameLift Servers - VentureBeat (Published: Fri, 18 Apr 2025 12:30:00 GMT)",
    "Apex Legends (Reddit)",
    "Faide Juking Everyone With New Wraith Buff #apexlegends (Published: 2025-03-26T20:00:09Z)",
    "ダメージ勝負で勝ちを確信したゆきぶやーの心をへし折るTIE Ru | Apex Legends (Published: 2025-04-03T10:14:27Z)"
  ],
  "fortnite": [
    "Fortnite Chapter 6 Season 3: Start Date, Star Wars Battle Pass, And Everything Else To Know - GameSpot (Published: Thu, 17 Apr 2025 21:10:49 GMT)",
    "Fortnite Dances (Reddit)",
    "Fortnite’s Arcane skins won’t be coming back for ‘the foreseeable future,’ Riot exec says - Polygon (Published: Thu, 17 Apr 2025 18:08:03 GMT)",
    "HACIENDO A BRR BRR PATAPIM EN FORTNITE! #EpicPartner #Fortnite (Published: 2025-04-11T20:00:30Z)",
    "Carlton from the Fresh Prince claims Fortnite stole his dance moves. Looks like he's right. (Reddit)",
    "Yes we all hate Fortnite, I understand. But respect to the kid. (Reddit)",
    "Fortnite Cody Rhodes and Undertaker skins release time, date and Bundle contents - Daily Express (Published: Fri, 18 Apr 2025 07:01:00 GMT)",
    "This is an advertised video on Youtube, currently showing up at the top of the front page for me, that's promising kids they can play Fortnite on their phones if they just \"install a few other apps to unlock it.\" Why is a video designed to scam children allowed to be advertised, YouTube? (Reddit)",
    "The Fortnite Effect (Reddit)",
    "Fortnite x Undertaker - Official Trailer - IGN (Published: Thu, 17 Apr 2025 19:28:19 GMT)",
    "HACIENDO A TUNG TUNG TUNG SAHUR EN FORTNITE! #EpicPartner #Fortnite #tungtungtungsahur (Published: 2025-04-11T00:19:35Z)",
    "LITTLE KID ROASTED HIS MOM 😂 (fortnite) @Wyful (Published: 2025-03-27T22:09:09Z)",
    "Fortnite x WWE collaboration: Release date, skins, prices - ONE Esports (Published: Thu, 17 Apr 2025 03:34:19 GMT)",
    "Custom Super Items in Fortnite! (Published: 2025-03-28T18:55:36Z)",
    "Nintendo Switch 2 Impressions: One Big Asterisk! (Published: 2025-04-03T22:49:16Z)"
  ],
  "pubg mobile": [
    "This is a very difficult move PUBG MOBİLE #pubgmobile #baby #pubg #funny #pubgindia (Published: 2025-03-25T22:02:49Z)",
    "They raped and murdered a boy because he had blocked them on PUBG Mobile. (Reddit)",
    "PUBG Mobile unbanned in Bangladesh after nearly 4 years - SportsTiger.com (Published: Fri, 18 Apr 2025 07:06:20 GMT)",
    "The importance of crosshair placement, why you're doing it wrong, and how to fix it. (Reddit)",
    "☠️ (Published: 2025-03-24T15:11:25Z)",
    "Regnum Carya Esports win PUBG Mobile Global Open 2025 - Field Level Media (Published: Sun, 13 Apr 2025 18:37:29 GMT)",
    "Over 1,000 fans celebrate PUBG MOBILE community dinner - The Nation Newspaper (Published: Fri, 18 Apr 2025 04:31:32 GMT)",
    "PUBG mobile consol? (Reddit)",
    "India bans PUBG, WeChat, and 118 other Chinese mobile applications (Reddit)",
    "ABONE OLARAK BANA DESTEK OL #pubgmobile #pubgm24 #pubg #pubgilover #bgmi #papci #gaming #pubgm (Published: 2025-04-12T14:23:13Z)",
    "New 5x scope 🤡🐸🤢 (Published: 2025-03-30T08:48:02Z)",
    "PUBG Mobile Launches Personalized Lucky Spin with Cheaper Draws - India Today Gaming (Published: Fri, 18 Apr 2025 10:00:00 GMT)",
    "Elevating Mealtime Fun: KFC Thailand X PUBG Mobile Captivates Gamers with Mobile App Marketing Strategy by AnyMind Group - AnyMind Group (Published: Thu, 17 Apr 2025 09:08:11 GMT)",
    "PubgM Controller #shorts#shortsfeed#controller#pubgmobile#cybotgaming#gaming#trending (Published: 2025-04-05T05:30:27Z)",
    "Among Us peak player count on steam exceeds 388k players, a new record for the game and the first time it has exceeded the daily peak player count of PUBG, making it the #3 game on steam. This is almost unheard of for a game that was made by small indie development with just 3 developers. (Reddit)"
  ],
  "league of legends": [
    "Riot Games Teaming With POP Mart for Arcane: League of Legends Blind Box Collection [EXCLUSIVE] - Game Rant (Published: Thu, 17 Apr 2025 22:00:00 GMT)",
    "Am I Overreacting bc I’m upset my husband cheated on me? :/ (Reddit)",
    "Stromae, Pomme - “Ma Meilleure Ennemie” (from Arcane Season 2) [Official Music Video] (Published: 2025-03-20T15:55:06Z)",
    "League of Legends to announce 2025 Hall of Legends inductee in May - Esports Insider (Published: Wed, 16 Apr 2025 15:54:38 GMT)",
    "A Dark Gambit | 2025 Season 1 Cinematic - League of Legends (Published: 2025-04-10T15:01:18Z)",
    "League of Legends Season 2: Hello Brawls, bye-bye Voracious Atakhan - Engadget (Published: Tue, 15 Apr 2025 15:00:28 GMT)",
    "League of Legends (Reddit)",
    "League Of Legends' Next Season Is Spirit Blossom Beyond - GameSpot (Published: Thu, 17 Apr 2025 12:15:34 GMT)",
    "Can you guess the League of Legends rank..? (Published: 2025-04-07T22:47:23Z)",
    "Brawl release date in League of Legends: All you need to know about the new deathmatch - ONE Esports (Published: Tue, 15 Apr 2025 15:00:00 GMT)",
    "Welcome to League of Legends (Reddit)",
    "When you uninstall league of legends (Reddit)",
    "Stromae, Pomme, Coldplay - “Ma Meilleure Ennemie ft. Coldplay” (from Arcane) [Official Lyric Video] (Published: 2025-04-04T04:00:36Z)",
    "When you used to play League of Legends and you also don’t know how to flirt (Reddit)",
    "Here, Tomorrow (ft Lilas, Kevin Penkin) - Spirit Blossom Beyond ‘25 S2 Cinematic - League of Legends (Published: 2025-04-14T14:55:08Z)"
  ],
  "dota2": [
    "ESL One Raleigh 2025 Recap: Winner and Top Teams - EGamersWorld (Published: Mon, 14 Apr 2025 11:30:59 GMT)",
    "КАК ПРАВИЛЬНО играть на НЕКРЕ #dota2 #дота2 (Published: 2025-03-31T05:59:00Z)",
    "7.00 (Reddit)",
    "Slark 1v5 Rampage 😤🫳🐟 #dota2 #дота2 #dota2highlights #dota2indonesia #dota2wtf (Published: 2025-04-08T20:14:31Z)",
    "Join the Battle for Net Neutrality! Net neutrality will die in a month and will affect Dota 2 and many other websites and services, unless we fight for it! (Reddit)",
    "/R/DOTA2 DOESN'T WANT THIS PIC OF OUR LORD MARC MERRILL ON /R/ALL, WHAT DO YOU THINK /R/THE_MERRILL? (Reddit)",
    "Dota 2’s high-MMR spectator ban explained – and why it might backfire - Esports Insider (Published: Thu, 17 Apr 2025 18:39:51 GMT)",
    "КОГДА ТЫ НОВИЧОК И КОГДА ТЫ УЖЕ ЗАДРОТ #дота #dota2 #дота2 (Published: 2025-04-12T20:27:26Z)",
    "As a lapsed 4,500 hour veteran of Dota 2, the big new Wandering Waters update has lured me back—but despite the changes, the game still feels stuck in its ways - PC Gamer (Published: Tue, 25 Feb 2025 08:00:00 GMT)",
    "Talon Esports becomes yet another betting ambassador in Dota 2 - BetUS (Published: Thu, 17 Apr 2025 17:51:53 GMT)",
    "Valve hands out gift wrapped bans in DotA2 (Reddit)",
    "Dota 2: Nature's Prophet, Ancient Apparition dominate ESL One Raleigh metagame - GosuGamers (Published: Wed, 16 Apr 2025 07:50:17 GMT)",
    "Need job? Play dota2 (Reddit)",
    "This Pango knows how to drive 🛒😎 #dota2 #дота2 #dota2highlights #dota2indonesia (Published: 2025-04-03T08:06:53Z)",
    "This timing was most perfect to connect 🤫 #dota2 #дота2 #dota2highlights #dota2indonesia (Published: 2025-04-07T20:56:36Z)"
  ]
}